app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def create
    @post = current_user.posts.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ('first postfirst postfirst postfirst post', '2010-06-29 02:17:13.323647', 'first post', '2010-06-29 02:17:13.323647')

  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 5) LIMIT 1
UPDATE "posts" SET "content" = '77777777', "updated_at" = '2010-06-30 09:46:57.977997' WHERE ("posts"."id" = 5)

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 6) LIMIT 1
DELETE FROM "posts" WHERE ("posts"."id" = 6)